{
  "services": [
    {
      "heading": "Product strategy",
      "text": "We transform assumptions into knowledge through the careful implementation of structured methods. Both new and existing products stand to benefit from the clarification of concepts and goals."
    },
    {
      "heading": "Product design",
      "text": "Great product design is what converts casual users into enthusiastic fans. Complex functionality can still be approachable and delightful. We turn your vision into remarkable experiences through research, testing, and prototyping."
    },
    {
      "heading": "Product development",
      "text": "Fruitful collaboration requires trust. You will work with a dedicated team of experienced engineers and designers from start to finish."
    }
  ],
  "product-design": [
    {
      "heading": "Easy is delightful",
      "text": "Design is more than making it pretty. Give your users the tools they need to get the job done with confidence, speed, and ease.",
      "linkText": "Read more on the blog",
      "linkUrl": "/blog/"
    },
    {
      "heading": "Every interaction matters",
      "text": "Design is more than making it pretty. Give your users the tools they need to get the job done with confidence, speed, and ease.",
      "linkText": "We like doing things “the right way”",
      "linkUrl": "/playbook/"
    },
    {
      "heading": "Clean, functional aesthetics",
      "text": "Design is more than making it pretty. Give your users the tools they need to get the job done with confidence, speed, and ease.",
      "linkText": "Book a call with a designer",
      "linkUrl": "/contact/"
    }
  ],
  "team-augmentation-and-training": [
    {
      "heading": "Deliver on time and on budget",
      "text": "We’ll be there in all conversations with your product teams to clarify goals and deadlines, discuss implementation options, and carefully assess the pros and cons of all major decisions. We’ll pair with your engineers to build features and squash bugs, and we’ll add numbers to your ranks to overcome any technical obstacles along the way.",
      "linkText": "Learn how we helped Trainline",
      "linkUrl": "/cases/trainline/"
    },
    {
      "heading": "Boost productivity",
      "text": "Mentorship is central to our team augmentation projects. We work to ensure that your team will become more efficient and impactful over the long term—well beyond our joint ventures.",
      "linkText": "Read about how we work",
      "linkUrl": "/playbook/"
    },
    {
      "heading": "Gain a fresh perspective",
      "text": "An outsider’s perspective can be a powerful tool for resolving longstanding impediments. Our experienced team will help you gain a deeper understanding of the potential risk factors in your codebase that you may be unaware of, and point out opportunities for you to move faster and accomplish your goals with less friction.",
      "linkText": "Read more on the blog",
      "linkUrl": "/blog/"
    }
  ],
  "training": [
    {
      "heading": "Workshops and in-house masterclasses",
      "text": "Bring your team up to speed with the necessary technologies so they can complete ambitious projects with confidence."
    },
    {
      "heading": "Code reviews & audits",
      "text": "Our code reviews identify and explain technical problems, and offer pragmatic solutions for moving forward. "
    },
    {
      "heading": "Custom training solutions",
      "text": "Your team has unique needs—which is why we offer customized training. We can help with Rust, Ember.js, Elixir/Phoenix, Ruby on Rails, and related technology stacks."
    }
  ]
}
